[
  {
    "type": "ol",
    "items": [
      "Home",
      "Lyrica"
    ]
  },
  {
    "type": "p",
    "text": "Generic name:pregabalin[pre-GAB-a-lin]Other brand namesof pregabalin include: Lyrica,Lyrica CRDrug class:Gamma-aminobutyric acid analogs"
  },
  {
    "type": "p",
    "text": "Medically reviewed bySophia Entringer, PharmD. Last updated on Nov 18, 2024."
  },
  {
    "type": "ul",
    "items": [
      "Uses",
      "Warnings",
      "Before taking",
      "Dosage",
      "Side effects",
      "Interactions",
      "FAQ"
    ]
  },
  {
    "type": "h2",
    "text": "What is Lyrica?",
    "children": [
      {
        "type": "p",
        "text": "Lyrica was originally FDA approved as an anti-epileptic drug, also called an anticonvulsant. It works by slowing down impulses in the brain that causeseizures. Pregabalin also affects chemicals in the brain that send pain signals across the nervous system."
      },
      {
        "type": "p",
        "text": "Lyrica is used to treat pain caused byfibromyalgia, or nerve pain in people with diabetes (diabetic neuropathy),herpes zoster(post-herpeticneuralgia), or spinal cord injury."
      },
      {
        "type": "p",
        "text": "Lyrica may also be used for purposes not listed in this medication guide."
      }
    ]
  },
  {
    "type": "h2",
    "text": "Warnings",
    "children": [
      {
        "type": "p",
        "text": "Lyrica can cause a severe allergic reaction.Stop taking this medicine and seek emergency medical help if you havehivesor blisters on your skin, trouble breathing, or swelling in your face, mouth, or throat."
      },
      {
        "type": "p",
        "text": "Some people have thoughts about suicide while taking Lyrica. Stay alert to changes in your mood or symptoms. Report any new or worsening symptoms to your doctor."
      },
      {
        "type": "p",
        "text": "If you have diabetes or heart problems, call your doctor if you have weight gain or swelling in your hands or feet while taking Lyrica."
      },
      {
        "type": "p",
        "text": "Do not stop using this medicine suddenly, even if you feel fine. Stopping suddenly may cause withdrawal symptoms."
      },
      {
        "type": "p",
        "text": "Do not change your dose without your doctor's advice. Tell your doctor if the medication does not seem to work as well in treating your condition."
      }
    ]
  },
  {
    "type": "h2",
    "text": "Before taking this medicine",
    "children": [
      {
        "type": "p",
        "text": "You should not use Lyrica if you are allergic to pregabalin."
      },
      {
        "type": "p",
        "text": "To make sure Lyrica is safe for you, tell your doctor if you have ever had:"
      },
      {
        "type": "ul",
        "items": [
          "lung disease, such as chronic obstructive pulmonary disease (COPD);",
          "a mood disorder, depression, or suicidal thoughts;",
          "heart problems (especially congestive heart failure);",
          "a bleeding disorder, or low levels of platelets in your blood;",
          "kidney disease (or if you are on dialysis);",
          "diabetes (unless you are taking pregabalin to treat diabetic neuropathy);",
          "drug or alcohol addiction; or",
          "a severe allergic reaction (angioedema)."
        ]
      },
      {
        "type": "p",
        "text": "lung disease, such as chronic obstructive pulmonary disease (COPD);"
      },
      {
        "type": "p",
        "text": "a mood disorder, depression, or suicidal thoughts;"
      },
      {
        "type": "p",
        "text": "heart problems (especially congestive heart failure);"
      },
      {
        "type": "p",
        "text": "a bleeding disorder, or low levels of platelets in your blood;"
      },
      {
        "type": "p",
        "text": "kidney disease (or if you are on dialysis);"
      },
      {
        "type": "p",
        "text": "diabetes (unless you are taking pregabalin to treat diabetic neuropathy);"
      },
      {
        "type": "p",
        "text": "drug or alcohol addiction; or"
      },
      {
        "type": "p",
        "text": "a severe allergic reaction (angioedema)."
      },
      {
        "type": "p",
        "text": "Do not give this medicine to a child without medical advice."
      },
      {
        "type": "ul",
        "items": [
          "Pregabalin is not approved for use by anyone younger than 18 years old to treat nerve pain caused by fibromyalgia, diabetes, herpes zoster, or spinal cord injury.",
          "Pregabalin is not approved for seizures in anyone younger than 1 month old."
        ]
      },
      {
        "type": "p",
        "text": "Pregabalin is not approved for use by anyone younger than 18 years old to treat nerve pain caused by fibromyalgia, diabetes, herpes zoster, or spinal cord injury."
      },
      {
        "type": "p",
        "text": "Pregabalin is not approved for seizures in anyone younger than 1 month old."
      },
      {
        "type": "p",
        "text": "Some people have thoughts about suicide while taking Lyrica. Your doctor will need to check your progress at regular visits. Your family or other caregivers should also be alert to changes in your mood or symptoms."
      },
      {
        "type": "p",
        "text": "Follow your doctor's instructions about taking seizure medication if you are pregnant. Seizure control is very important during pregnancy, and having a seizure could harm both mother and baby.Do not start or stop taking this medicine without your doctor's advice, and tell your doctor right away if you become pregnant."
      },
      {
        "type": "p",
        "text": "If you are pregnant, your name may be listed on a pregnancy registry to track the effects of pregabalin on the baby."
      },
      {
        "type": "p",
        "text": "Pregabalin can temporarily decrease sperm count and may affect fertility in men (your ability to have children). In animal studies, pregabalin also caused birth defects in the offspring of males treated with this medicine. However, it is not known whether these effects would occur in humans. Ask your doctor about your risk."
      },
      {
        "type": "p",
        "text": "You should not breastfeed while using pregabalin."
      }
    ]
  },
  {
    "type": "h2",
    "text": "How should I take Lyrica?",
    "children": [
      {
        "type": "p",
        "text": "Take Lyrica exactly as prescribed by your doctor. Follow all directions on your prescription label and read all medication guides or instruction sheets. Your doctor may occasionally change your dose. Use the medicine exactly as directed."
      },
      {
        "type": "p",
        "text": "Take the medicine at the same time each day, with or without food."
      },
      {
        "type": "p",
        "text": "Do not crush, chew, or break anextended-release tablet.Swallow the tablet whole."
      },
      {
        "type": "p",
        "text": "Measure liquid medicine with the dosing syringe provided, or with a special dose-measuring spoon or medicine cup. If you do not have a dose-measuring device, ask your pharmacist for one."
      },
      {
        "type": "p",
        "text": "Call your doctor if your symptoms do not improve, or if they get worse."
      },
      {
        "type": "p",
        "text": "Do not stop using Lyrica suddenly,even if you feel fine. Stopping suddenly may cause increased seizures or unpleasant withdrawal symptoms. Follow your doctor's instructions about tapering your dose for at least 1 week before stopping completely."
      },
      {
        "type": "p",
        "text": "In case of emergency, wear or carry medical identification to let others know you take seizure medication."
      },
      {
        "type": "p",
        "text": "Store at room temperature away from moisture, heat, and light."
      }
    ]
  },
  {
    "type": "h2",
    "text": "What happens if I miss a dose?",
    "children": [
      {
        "type": "p",
        "text": "Take the medicine as soon as you can, but skip the missed dose if it is almost time for your next dose. Do not take two doses at one time."
      }
    ]
  },
  {
    "type": "h2",
    "text": "What happens if I overdose?",
    "children": [
      {
        "type": "p",
        "text": "Seek emergency medical attention or call the Poison Help line at 1-800-222-1222."
      }
    ]
  },
  {
    "type": "h2",
    "text": "What to avoid",
    "children": [
      {
        "type": "p",
        "text": "Avoid drinking alcohol. It may increase certain side effects of Lyrica."
      },
      {
        "type": "p",
        "text": "Avoid driving or hazardous activity until you know how this medicine will affect you. Your reactions could be impaired."
      }
    ]
  },
  {
    "type": "h2",
    "text": "Lyrica side effects",
    "children": [
      {
        "type": "p",
        "text": "Lyrica can cause a severe allergic reaction. Stop taking this medicine and get emergency medical help if you have:hives or blisters on your skin; difficult breathing; swelling of your face, lips, tongue, or throat."
      },
      {
        "type": "p",
        "text": "Report any new or worsening symptoms to your doctor, such as: mood or behavior changes, depression,anxiety,panic attacks, trouble sleeping, or if you feel impulsive, irritable, agitated, hostile, aggressive, restless, hyperactive (mentally or physically), or have thoughts about suicide or hurting yourself."
      },
      {
        "type": "p",
        "text": "Call your doctor at once if you have:"
      },
      {
        "type": "ul",
        "items": [
          "weak or shallow breathing;",
          "blue-colored skin, lips, fingers, and toes;",
          "confusion, extreme drowsiness or weakness;",
          "vision problems;",
          "skin sores (if you have diabetes);",
          "easy bruising, unusual bleeding;",
          "swelling in your hands or feet, rapid weight gain (especially if you have diabetes or heart problems); or",
          "unexplained muscle pain, tenderness, or weakness (especially if you also have fever or don't feel well)."
        ]
      },
      {
        "type": "p",
        "text": "weak or shallow breathing;"
      },
      {
        "type": "p",
        "text": "blue-colored skin, lips, fingers, and toes;"
      },
      {
        "type": "p",
        "text": "confusion, extreme drowsiness or weakness;"
      },
      {
        "type": "p",
        "text": "vision problems;"
      },
      {
        "type": "p",
        "text": "skin sores (if you have diabetes);"
      },
      {
        "type": "p",
        "text": "easy bruising, unusual bleeding;"
      },
      {
        "type": "p",
        "text": "swelling in your hands or feet, rapid weight gain (especially if you have diabetes or heart problems); or"
      },
      {
        "type": "p",
        "text": "unexplained muscle pain, tenderness, or weakness (especially if you also have fever or don't feel well)."
      },
      {
        "type": "p",
        "text": "Pregabalin can cause life-threatening breathing problems.A person caring for you should seek emergency medical attention if you have slow breathing with long pauses, blue colored lips, or if you are hard to wake up. Breathing problems may be more likely in older adults or in people with COPD."
      },
      {
        "type": "p",
        "text": "If you have diabetes, tell your doctor right away if you have any new sores or other skin problems."
      },
      {
        "type": "p",
        "text": "Common Lyrica side effects may include:"
      },
      {
        "type": "ul",
        "items": [
          "dizziness, drowsiness;",
          "swelling in your hands and feet;",
          "trouble concentrating;",
          "increased appetite;",
          "weight gain;",
          "dry mouth; or",
          "blurred vision."
        ]
      },
      {
        "type": "p",
        "text": "dizziness, drowsiness;"
      },
      {
        "type": "p",
        "text": "swelling in your hands and feet;"
      },
      {
        "type": "p",
        "text": "trouble concentrating;"
      },
      {
        "type": "p",
        "text": "increased appetite;"
      },
      {
        "type": "p",
        "text": "weight gain;"
      },
      {
        "type": "p",
        "text": "dry mouth; or"
      },
      {
        "type": "p",
        "text": "blurred vision."
      },
      {
        "type": "p",
        "text": "This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088."
      }
    ]
  },
  {
    "type": "h2",
    "text": "Related/similar drugs",
    "children": [
      {
        "type": "h3",
        "text": "Lidocaine Viscous",
        "children": [
          {
            "type": "p",
            "text": "Lidocaine Viscous is used for anesthesia, gastrointestinal surgery, gastrointestinal tract ..."
          }
        ]
      },
      {
        "type": "h3",
        "text": "Lidoderm",
        "children": [
          {
            "type": "p",
            "text": "Lidoderm is a lidocaine patch used to relieve nerve pain after shingles by numbing the skin and ..."
          }
        ]
      },
      {
        "type": "h3",
        "text": "Ozempic",
        "children": [
          {
            "type": "p",
            "text": "Learn about Ozempic (semaglutide) for type 2 diabetes treatment, weight management, cardiovascular ..."
          }
        ]
      },
      {
        "type": "h3",
        "text": "Qutenza",
        "children": [
          {
            "type": "p",
            "text": "Qutenza patches are used to treat neuropathic pain associated with postherpetic neuralgia and ..."
          }
        ]
      },
      {
        "type": "h3",
        "text": "Xylocaine Jelly",
        "children": [
          {
            "type": "p",
            "text": "Xylocaine Jelly is used for anal itching, anesthesia, burns, external, gastrointestinal surgery ..."
          }
        ]
      },
      {
        "type": "h3",
        "text": "Zostrix",
        "children": [
          {
            "type": "p",
            "text": "Zostrix is used for diabetic peripheral neuropathy, osteoarthritis, pain, postherpetic neuralgia"
          }
        ]
      },
      {
        "type": "h3",
        "text": "Capsaicin topical",
        "children": [
          {
            "type": "p",
            "text": "Capsaicin is the active compound in chili peppers that creates their characteristic heat. When ..."
          }
        ]
      },
      {
        "type": "h3",
        "text": "Lidocaine topical",
        "children": [
          {
            "type": "p",
            "text": "Lidocaine topical is used for anal itching, anesthesia, burns, external, gastrointestinal surgery ..."
          }
        ]
      }
    ]
  },
  {
    "type": "h2",
    "text": "What other drugs will affect Lyrica?",
    "children": [
      {
        "type": "p",
        "text": "Using Lyrica with other drugs that slow your breathing can cause dangerous side effects or death.Ask your doctor before using opioid medication, a sleeping pill, cold or allergy medicine, a muscle relaxer, or medicine for anxiety or seizures."
      },
      {
        "type": "p",
        "text": "Tell your doctor about all your other medicines, especially:"
      },
      {
        "type": "ul",
        "items": [
          "oral diabetes medicine-pioglitazone,rosiglitazone; or",
          "an ACE inhibitor-benazepril,captopril,enalapril,fosinopril,lisinopril,moexipril,perindopril,quinapril,ramipril, ortrandolapril.",
          "any other seizure medications"
        ]
      },
      {
        "type": "p",
        "text": "oral diabetes medicine-pioglitazone,rosiglitazone; or"
      },
      {
        "type": "p",
        "text": "an ACE inhibitor-benazepril,captopril,enalapril,fosinopril,lisinopril,moexipril,perindopril,quinapril,ramipril, ortrandolapril."
      },
      {
        "type": "p",
        "text": "any other seizure medications"
      },
      {
        "type": "p",
        "text": "This list is not complete. Other drugs may interact with pregabalin, including prescription and over-the-counter medicines,vitamins, andherbal products. Not all possible drug interactions are listed here."
      },
      {
        "type": "h3",
        "text": "Does Lyrica interact with my other drugs?",
        "children": [
          {
            "type": "p",
            "text": "Enter medications to view a detailed interaction report using ourDrug Interaction Checker."
          }
        ]
      }
    ]
  },
  {
    "type": "h2",
    "text": "Popular FAQ",
    "children": [
      {
        "type": "p",
        "text": "In clinical studies with Lyrica, some patients experienced a decrease in pain as early as the first week, which persisted during the entire study period of 5 to 13 weeks.Continue reading"
      },
      {
        "type": "p",
        "text": "Lyrica (pregabalin) will stay in your blood (plasma) for about 35 hours, but its clinical effect may wear off before this time. Studies have shown pregabalin to be detectable in urine for up to 5 to 6 days.Continue reading"
      },
      {
        "type": "p",
        "text": "Weight gain is a common side effect associated with Lyrica treatment. In studies, 9% of Lyrica-treated patients and 2% of placebo-treated patients gained 7% or more compared to their weight at the beginning of the study. Lyrica is also linked with an increase in appetite and fluid retention.Continue reading"
      },
      {
        "type": "p",
        "text": "Only in certain circumstances should you should stop taking Lyrica or Lyrica CR (pregabalin) right away. You should stop taking this medicine if your doctor has told you to stop immediately; you are having a severe, life-threatening allergic reaction; you have developed angioedema (swelling and build-up of fluid under your skin, usually in the facial or gential area), or you have trouble breathing (for example: shortness of breath, wheezing). If any of these reactions do occur, stop taking the medicine and call your healthcare provider or emergency medical services (911) right away.Continue reading"
      },
      {
        "type": "p",
        "text": "Lyrica (pregabalin) is a Schedule V (Schedule 5) controlled substance, the lowest schedule for abuse potential, as defined by the DEA. It is not a narcotic (opioid), but is used to treat various types of nerve pain (diabetic neuropathy, herpes zoster), as well as epilepsy, fibromyalgia and spinal cord injury.Continue reading"
      },
      {
        "type": "p",
        "text": "Yes, Lyrica (pregabalin) can cause extreme drowsiness (somnolence) and may affect your ability to drive, operate machinery, or do other dangerous activities. This may lead to an injury or fall. In studies, up to 20% of children and 35% of adults experienced drowsiness as a side effect.Continue reading"
      },
      {
        "type": "p",
        "text": "Lyrica (generic name: pregabalin) immediate-release capsules and oral solution are available as a generic in the US. The FDA approved generic pregabalin in July 2019. Lyrica, the brand name product from Pfizer is still available. The generic for Lyrica CR, an extended-release tablet of pregabalin, is not yet available.Continue reading"
      },
      {
        "type": "p",
        "text": "Lyrica (pregabalin) is used to treat fibromyalgia, and nerve pain associated with diabetic neuropathy, shingles (postherpetic neuralgia), and spinal cord injuries in adults 18 years and older. It is also approved as an add-on therapy for partial-onset seizures (epilepsy) in patients one month and older. Lyrica CR is used to treat diabetic nerve pain and nerve pain after shingles.Continue reading"
      },
      {
        "type": "h3",
        "text": "More FAQ",
        "children": [
          {
            "type": "ul",
            "items": [
              "Lyrica vs Gabapentin: What's the difference?"
            ]
          },
          {
            "type": "p",
            "text": "View more FAQ"
          }
        ]
      }
    ]
  },
  {
    "type": "h2",
    "text": "More about Lyrica (pregabalin)",
    "children": [
      {
        "type": "ul",
        "items": [
          "Check interactions",
          "Compare alternatives",
          "Pricing & coupons",
          "Reviews (928)",
          "Drug images",
          "Side effects",
          "Dosage information",
          "Patient tips",
          "During pregnancy",
          "Generic availability",
          "Support group",
          "FDA approval history",
          "Drug class: gamma-aminobutyric acid analogs",
          "Breastfeeding",
          "En español"
        ]
      },
      {
        "type": "h3",
        "text": "Patient resources",
        "children": [
          {
            "type": "ul",
            "items": [
              "Lyrica (Pregabalin Capsules) patient information",
              "Lyrica (Pregabalin Oral Solution)"
            ]
          },
          {
            "type": "p",
            "text": "Lyrica CR"
          }
        ]
      },
      {
        "type": "h3",
        "text": "Professional resources",
        "children": [
          {
            "type": "ul",
            "items": [
              "Lyrica prescribing information",
              "Pregabalin(AHFS Monograph)"
            ]
          },
          {
            "type": "p",
            "text": "Lyrica CR"
          }
        ]
      },
      {
        "type": "h3",
        "text": "Related treatment guides",
        "children": [
          {
            "type": "ul",
            "items": [
              "Neuropathic Pain",
              "Fibromyalgia",
              "Neuralgia",
              "Postherpetic Neuralgia",
              "Diabetic Peripheral Neuropathy",
              "Epilepsy"
            ]
          }
        ]
      }
    ]
  },
  {
    "type": "h2",
    "text": "Further information",
    "children": [
      {
        "type": "p",
        "text": "Remember, keep this and all other medicines out of the reach of children, never share your medicines with others, and use Lyrica only for the indication prescribed."
      },
      {
        "type": "p",
        "text": "Always consult your healthcare provider to ensure the information displayed on this page applies to your personal circumstances."
      },
      {
        "type": "p",
        "text": "Medical Disclaimer"
      },
      {
        "type": "p",
        "text": "Copyright 1996-2025 Cerner Multum, Inc. Version: 9.01."
      }
    ]
  }
]